@extends('layouts.main')

@section('content')
<div class="main-title2">隱私權政策</div>

<div class="terms-content">
    <p class="top-text">CityPass都會通非常重視會員的隱私權且遵循「個人資料保護法」之規定，因此制訂了隱私權保護政策，您可參考下列隱私權保護政策的內容。</p>
    <div class="title">一、個人資料之安全</div>
    <div class="content">
        保護會員的個人隱私是CityPass都會通重要的經營理念，在未經會員同意之下，我們絕不會將會員的個人資料提供予任何與本購物網站服務無關之第三人。會員應妥善保密自己的網路密碼及個人資料，不要將任何個人資料，尤其是網路密碼提供給任何人。在使用完CityPass都會通網站所提供的各項服務功能後，務必記得登出帳戶，若是與他人共享電腦或使用公共電腦，切記要關閉瀏覽器視窗。
    </div>
    <div class="title">二、個人資料的蒐集、處理、利用</div>
    <div class="content">
        <div>CityPass都會通相關網站所取得的個人資料，都僅供CityPass都會通於其內部、依照原來所說明的使用目的和範圍，除非事先說明、或依照相關法律規定，否則CityPass都會通不會將資料提供給第三人、或移作其他目的使用。</div>
        <ul class="circle-list padding-left-15">
            <li>蒐集之目的：</li>
            <div>蒐集之目的在於進行行銷業務、消費者、客戶管理與服務、網路購物及其他電子商務服務及與調查、統計與研究分析。CityPass都會通將藉由加入會員之過程或進行交易之過程來蒐集個人資料。</div>
            <li>蒐集之個人資料類別：</li>
            <div>
                <p>CityPass都會通於網站內蒐集的個人資料包括，</p>
                <p>(1) C001辨識個人者： 如會員之姓名、地址、電話、電子郵件等資訊。</p>
                <p>(2) C002辨識財務者： 如信用卡或金融機構帳戶資訊。</p>
                <p>(3) C011個人描述：例如：性別、出生年月日等。</p>
            </div>
            <li>利用期間、地區、對象及方式：</li>
            <div>
                <p>(1) 期間：會員當事人要求停止使用或CityPass都會通停止提供服務之日為止。</p>
                <p>(2) 地區：會員之個人資料將用於台灣地區。</p>
                <p>(3) 利用對象及方式：會員之個人資料蒐集除用於CityPass都會通之會員管理、客戶管理之檢索查詢等功能外，亦將利用於辨識身份、金流服務、物流服務、行銷廣宣等。例示如下：</p>
                <ul class="lower-latin-list padding-left-30">
                    <li>以會員身份使用CityPass都會通提供之各項服務時，於頁面中自動顯示會員資訊。</li>
                    <li>為遂行交易行為：會員對商品或勞務為預約、下標、購買、參與贈獎等之活動或從事其他交易時，關於商品配送、勞務提供、價金給付、回覆客戶之詢問、博客來對會員之詢問、相關售後服務及其他遂行交易所必要之業務。</li>
                    <li>宣傳廣告或行銷等：提供會員各種電子雜誌等資訊、透過電子郵件、郵件、電話等提供與服務有關之資訊。將會員所瀏覽之內容或廣告，依客戶之個人屬性或購買紀錄、博客來網站之瀏覽紀錄等項目，進行個人化作業、會員使用服務之分析、新服務之開發或既有服務之改善等。針對民調、活動、留言版等之意見，或其他服務關連事項，與會員進行聯繫。</li>
                    <li>回覆客戶之詢問：針對會員透過電子郵件、郵件、、傳真、電話或其他任何直接間接連絡方式向博客來所提出之詢問進行回覆。</li>
                    <li>其他業務附隨之事項：附隨於上述a至d.之利用目的而為博客來提供服務所必要之使用。</li>
                    <li>對於各別服務提供者之資訊提供：會員對服務提供者之商品或勞務為預約、下標、購買、參加贈獎活動或申請其他交易時，CityPass都會通於該交易所必要之範圍內，得將會員之個人資料檔案提供予服務提供者，並由服務提供者負責管理該個人資料檔案。CityPass都會通將以規約課予服務提供者依保障會員隱私權之原則處理個人資料之義務，但無法保證服務提供者會必然遵守。詳細內容，請向各別服務提供者洽詢。</li>
                    <li>其他：提供個別服務時，亦可能於上述規定之目的以外，利用個人資料。此時將在該個別服務之網頁載明其要旨。</li>
                </ul>
            </div>
            <li>會員就個人資料之權利：</li>
            <div>
                <p>CityPass都會通所蒐集個人資料之當事人，依個人資料保護法得對CityPass都會通行使以下權利：</p>
                <p>(1) 查詢或請求閱覽。</p>
                <p>(2) 請求製給複製本。</p>
                <p>(3) 請求補充或更正。</p>
                <p>(4) 請求停止蒐集、處理或利用。</p>
                <p>(5) 請求刪除。</p>
                <p>會員如欲行使上述權利，可與CityPass都會通客服連絡進行申請。</p>
            </div>
            <li>請注意！如拒絕提供加入會員所需必要之資料，將可能導致無法享受完整服務或完全無法使用該項服務。</li>
        </ul>
    </div>
    <div class="title">三、資料安全</div>
    <div class="content">
        為保障會員的隱私及安全，CityPass都會通會員帳號資料會用密碼保護。CityPass都會通並盡力以合理之技術及程序，保障所有個人資料之安全。
    </div>
    <div class="title">四、個人資料查詢或更正的方式</div>
    <div class="content">
        會員對於其個人資料，有查詢及閱覽、製給複製本、補充或更正、停止電腦處理及利用、刪除等需求時，可以與客服中心聯絡，CityPass都會通將迅速進行處理。
    </div>
    <div class="title">五、Cookie</div>
    <div class="content">
        為了便利會員使用，CityPass都會通網站會使用cookie技術，以便於提供會員所需要的服務；cookie是網站伺服器用來和會員瀏覽器進行溝通的一種技術，它可能在會員的電腦中隨機儲存字串，用以辨識區別使用者，若會員關閉cookie有可能導致無法順利登入網站或無法使用購物車等狀況。
    </div>
    <div class="title">六、隱私權保護政策修訂</div>
    <div class="content">
        隨著市場環境的改變本公司將會不時修訂網站政策。會員如果對於CityPass都會通網站隱私權聲明、或與個人資料有關之相關事項有任何疑問，可以利用電子郵件和 CityPass都會通
        <a class="btn-link" href="#">客服中心聯絡</a>。
    </div>
</div>
@endsection
