@extends('layouts.main')

@section('content')
<div class="main-title2">退換貨方式</div>

<div class="tabs-content">
    <div class="terms-content styel2">
        <div class="title styel2">【電子票券】</div>
        <p class="color-blue">退換貨說明</p>
        <p>· 電子票券申請退票期限為各店家或主辦單位制訂，請先查看您所購買商品的「退貨須知」。</p>
        <p>· 為節省更換商品的等候時間，本平台全面採用只退不換的方式，若您有換貨需求，請辦理退貨後，重新訂購。</p>
        <p>· 如發現會員因個人因素退貨次數過多，CityPass都會通將依據服務條款，暫停或終止您全部或部份的購物與服務資格，敬請見諒。</p>
        <p class="color-blue">退貨申請</p>
        <p>· 商品辦理退訂/退貨，請點選下載《<a class="btn-link" href="https://middleware.citypass.tw/files/citypass_return.docx">退貨申請</a>》填寫欲退貨品項、數量、點選退貨原因，包含訂單編號與電子信箱，並同意代為進行發票折讓，寄送完成申請至客服信箱service@citypass.tw，客服人員於三天內將儘快與您聯繫確認。</p>
        <p class="color-blue">退貨方式</p>
        <p>若電子票券完成退貨流程，您的訂單狀態會顯示已退票，且CityPass都會通 APP票匣內將回收該張票券。</p>
        <p class="color-blue">退款方式</p>
        <p>退貨款項乃依據原訂單付款方式處理。</p>
        <p><span class="color-red">使用「信用卡」付款</span>：款項將退回原付款之信用卡。</p>
        <p>· 信用卡因受個人信用卡結帳週期影響，款項可能會顯示下期信用卡帳單上，請留意近二期信用卡帳單或向發卡銀行洽詢。</p>
        <p><span class="color-red">使用「ATM虛擬帳號轉帳」付款</span>：款項將退回您指定的銀行帳戶。</p>
        <p><span class="color-red">使用「LINE Pay」付款</span>：依照您設定的 LINE Pay 付款方式進行退款，使用信用卡付款者將進行信用卡刷退；使用 LINE Pay 儲值帳戶付款者將進行退款至您的LINE Pay帳戶中。</p>
        <p class="color-blue">退貨退款進度</p>
        <p>處理退貨申請約3~5個工作天，確認退貨屬實後，將退款流程為您辦理款項之退還。</p>
        <p>退款完成時我們將發通知信提醒您。</p>
        <div class="title styel2">【實體商品】</div>
        <p class="color-blue">退換貨說明</p>
        <p>· 依據消費者保護法之規定，消費者得於收到商品或接受服務後七天內，以退回商品或書面通知方式解除契約，無須說明理由及負擔任何費用或對價。但以下情形例外不適用：</p>
        <ul class="decimal-list padding-left-15">
            <li>易於腐敗、保存期限較短或解約時即將逾期。</li>
            <li>依消費者要求所為之客製化給付。</li>
            <li>報紙、期刊或雜誌。</li>
            <li>經消費者拆封之影音商品或電腦軟體。</li>
            <li>非以有形媒介提供之數位內容或一經提供即為完成之線上服務，經消費者事先同意始提供。</li>
            <li>已拆封之個人衛生用品。</li>
            <li>國際航空客運服務商品申請退換貨需保持商品本體、保證書、配件(贈品)、所有隨附文件與原廠包裝的完整性，如有缺漏或毀損皆會影響自身退貨的權益，或需依照商品損毀程度進行費用的索取。</li>
        </ul>
        <p>· 單筆訂單僅受理一次來回退貨服務。</p>
        <p>· 若同一訂單為訂購優惠組合或同時訂購多件商品，則需【整筆】訂單辦理退貨，請恕無法單獨退貨部分商品。</p>
        <p>· 為節省更換商品的等候時間，本平台全面採用只退不換的方式，若您有換貨需求，請辦理退貨後，重新訂購。</p>
        <p>· 如發現會員因個人因素退貨次數過多，CityPass都會通將依據服務條款，暫停或終止您全部或部份的購物與服務資格，敬請見諒。</p>
        <p class="color-blue">退貨申請</p>
        <p>· 商品辦理退訂/退貨，請點選下載《<a class="btn-link" href="https://middleware.citypass.tw/files/citypass_return.docx">退貨申請</a>》填寫欲退貨品項、數量、點選退貨原因，包含訂單編號與電子信箱，並同意代為進行發票折讓，寄送完成申請至客服信箱service@citypass.tw，客服人員於三天內將儘快與您聯繫確認。</p>
        <p>· 申請退貨翌日起算15個工作天，若因無法聯繫、商品未寄回無法完成退貨作業，將自動取消退貨申請，且不可再次申請。</p>
        <p>· 退貨取件完成後，請保留宅配取貨單據，以方便日後查詢。</p>
        <p class="color-blue">退貨方式</p>
        <p>宅配收件：辦理退貨時，需由宅配到府收取包裏。申請退貨手續完成後，請保持手機暢通，避免因宅配人員無法與您連繫，而延誤退貨申請時間。</p>
        <p>· 請於退貨商品外包裝附上：姓名、電話、訂單編號、地址，以利退貨作業查詢。</p>
        <p class="color-blue">退款方式</p>
        <p>退貨款項乃依據原訂單付款方式處理。</p>
        <p><span class="color-red">使用「信用卡」付款</span>：款項將退回原付款之信用卡。</p>
        <p>· 信用卡因受個人信用卡結帳週期影響，款項可能會顯示下期信用卡帳單上，請留意近二期信用卡帳單或向發卡銀行洽詢。</p>
        <p><span class="color-red">使用「ATM虛擬帳號轉帳」付款</span>：款項將退回您指定的銀行帳戶。</p>
        <p><span class="color-red">使用「LINE Pay」付款</span>：依照您設定的 LINE Pay 付款方式進行退款，使用信用卡付款者將進行信用卡刷退；使用 LINE Pay 儲值帳戶付款者將進行退款至您的LINE Pay帳戶中。</p>
        <p class="color-blue">退貨退款進度</p>
        <p>收到退貨商品後，退貨處理作業約3~5個工作天，確認退貨商品無誤後，將於三週內辦理退款。退款完成將發通知信提醒您。</p>
    </div>
</div>
@endsection
